# Web Scraping- Selenium

# Q1: Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data. This task will be done in following steps:

1.First get the webpage https://www.naukri.com/
2.Enter “Data Analyst” in “Skill, Designations, Companies” field and enter “Bangalore” in “enter the location” field.
3.Then click the search button.
4.Then scrape the data for the first 10 jobs results you get.
5.Finally create a dataframe of the scraped data.

In [5]:
#First install the Selenium

!pip install selenium

Requirement already satisfied: selenium in c:\users\vikrant\anaconda3\lib\site-packages (4.4.3)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\vikrant\anaconda3\lib\site-packages (from selenium) (0.9.2)
Requirement already satisfied: urllib3[socks]~=1.26 in c:\users\vikrant\anaconda3\lib\site-packages (from selenium) (1.26.7)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\vikrant\anaconda3\lib\site-packages (from selenium) (2021.10.8)
Requirement already satisfied: trio~=0.17 in c:\users\vikrant\anaconda3\lib\site-packages (from selenium) (0.21.0)
Requirement already satisfied: cffi>=1.14 in c:\users\vikrant\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.14.6)
Requirement already satisfied: attrs>=19.2.0 in c:\users\vikrant\anaconda3\lib\site-packages (from trio~=0.17->selenium) (21.2.0)
Requirement already satisfied: async-generator>=1.9 in c:\users\vikrant\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.10)
Requirement already satisfied: idna in c:\users\vikrant\anaconda3\lib\site-packages (from trio~=0.17->selenium) (3.2)
Requirement already satisfied: outcome in c:\users\vikrant\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: sniffio in c:\users\vikrant\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.2.0)
Requirement already satisfied: sortedcontainers in c:\users\vikrant\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: pycparser in c:\users\vikrant\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.20)
Requirement already satisfied: wsproto>=0.14 in c:\users\vikrant\anaconda3\lib\site-packages (from trio-websocket~=0.9->selenium) (1.1.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\users\vikrant\anaconda3\lib\site-packages (from urllib3[socks]~=1.26->selenium) (1.7.1)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\vikrant\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.13.0)

In [10]:
#import all required libraries 
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
import time
from selenium.webdriver.common.by import By

In [11]:
#lets connect with web driver

driver=webdriver.Chrome(r"C:\Users\vikrant\Downloads\chromedriver_win32\chromedriver.exe")

In [12]:
#Let first connect to the driver
driver=webdriver.Chrome(r"chromedriver.exe")

In [13]:
#onpening the naukri.com website on automated chrome window
driver.get('https://www.naukri.com/')

In [14]:
#Finding element for job search bar
Designation=driver.find_element(By.CLASS_NAME,"suggestor-input")
Designation.send_keys('Data Analyst')

In [15]:
#Entering Location banglore in location search bar
#search_field_loc=driver.find_element_by_class_name('suggestor-input') #here for location same class name came so we have to use absolute xpath
#search_field_loc.send_keys('banglore')

In [16]:
search_field_loc=driver.find_element(By.XPATH,'/html/body/div/div[2]/div[3]/div/div/div[5]/div/div/div/input')
search_field_loc.send_keys('banglore')

In [17]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [19]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [20]:
title_tags=driver.find_elements(By.XPATH,'//a[@class="title fw500 ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)

In [21]:
#scraping job location
location_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi location"]')
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)

In [22]:
#scraping company name
company_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)

In [23]:
#scraping job experience
experience_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi experience"]//span')
for i in experience_tags[0:10]:
    exp=i.text
    experience_required.append(exp)

In [24]:
print(len(job_title),len(job_location),len(company_name),len(experience_required))

10 10 10 10

In [25]:
df=pd.DataFrame({'Job Titiel':job_title,'Job Location':job_location,'Company Name':company_name,'Experience Required':experience_required})
df

,Job Titiel,Job Location,Company Name,Experience Required
0,Business & Data Analyst- Assistant Manager,"Hyderabad/Secunderabad, Bangalore/Bengaluru",State Street,1-3 Yrs
1,Sr. Business Data Analyst,Bangalore/Bengaluru,Infometry,4-6 Yrs
2,Sr Clinical Data Analyst,Bangalore/Bengaluru,LabCorp,2-5 Yrs
3,Manager / Senior Manager - Data Analyst,"Mumbai, Hyderabad/Secunderabad, Pune, Gurgaon/...",Huquo Consulting Pvt. Ltd,2-7 Yrs
4,Senior Data Analyst(Power BI/Python),Bangalore/Bengaluru,Societe Generale,3-7 Yrs
5,Sr. Data Analyst,"Bhopal, Indore, New Delhi, Pune, Bangalore Rur...",Netlink Software,3-6 Yrs
6,Business Analyst - Data Strategy,Bangalore/Bengaluru,Capco,9-11 Yrs
7,DATA Analyst- Immediate Joining,Bangalore/Bengaluru(Cox Town),ADVISETREE CONSULTING PRIVATE LIMITED,3-5 Yrs
8,Senior Data Analyst,Bangalore/Bengaluru(Old Madras Road),KrazyBee,3-6 Yrs
9,Senior Data Analyst,Bangalore/Bengaluru,Qualitest India Private Limited,5-8 Yrs

# Q2: Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data. This task will be done in following steps:

1.First get the webpage https://www.naukri.com/
2.Enter “Data Scientist” in “Skill, Designations, Companies” field and enter “Bangalore” in “enter the location” field.
3.Then click the search button.
4.Then scrape the data for the first 10 jobs results you get.
5.Finally create a dataframe of the scraped data.

In [26]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [27]:
driver.get("https://www.naukri.com/")

In [28]:
#Finding element for job search bar
Designation=driver.find_element(By.CLASS_NAME,"suggestor-input")
Designation.send_keys('Data Scientist')

In [29]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[3]/div/div/div[5]/div/div/div/input")
location.send_keys('Bangalore')

In [30]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [31]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [32]:
title_tags=driver.find_elements(By.XPATH,'//a[@class="title fw500 ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)

In [33]:
company_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)

In [34]:
location_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi location"]')
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)

In [35]:
experience_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi experience"]//span')
for i in experience_tags[0:10]:
    exp=i.text
    experience_required.append(exp)

In [36]:
df=pd.DataFrame({'Job Title':job_title,'Job Location':job_location,'Company Name':company_name,'Experience Required':experience_required})
df

,Job Title,Job Location,Company Name,Experience Required
0,Lead ML Scientist,"Bangalore/Bengaluru, Mumbai",Fractal Analytics,6-10 Yrs
1,Analystics & Modeling Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,6-8 Yrs
2,Data scientist _Tata Consultancy Services(Tcs),"Bangalore/Bengaluru, Kochi/Cochin, Indore, New...",TATA CONSULTANCY SERVICES (TCS),9-14 Yrs
3,Job||Job Opening For AI Technologist - Data Sc...,"Bangalore/Bengaluru, New Delhi, Hyderabad/Secu...",Wipro,5-10 Yrs
4,Hiring For DATA Scientist @ NTT DATA Business ...,"Bangalore/Bengaluru, Noida, Hyderabad/Secunder...",NTT DATA Business Solutions Private Limited,4-9 Yrs
5,Tcs Hiring For Data Scientist,"Bangalore/Bengaluru, Chennai, Mumbai (All Areas)",TATA CONSULTANCY SERVICES (TCS),3-8 Yrs
6,Senior Manager - EmTech - Machine Learning - P&T,"Bangalore/Bengaluru, Mumbai, Hyderabad/Secunde...",PwC,5-12 Yrs
7,Urgent Job Opening For AI Practitioner - Data ...,"Bangalore/Bengaluru, Kochi/Cochin, New Delhi, ...",Wipro,11-20 Yrs
8,Data Scientist Lead_Tata Consultancy Services(...,"Bangalore/Bengaluru, Kolkata, Hyderabad/Secund...",TATA CONSULTANCY SERVICES (TCS),8-12 Yrs
9,Assistant Manager - Data Science,"Bangalore/Bengaluru, Mumbai, Pune",CitiusTech,5-9 Yrs

# Q3: In this question you have to scrape data using the filters available on the webpage: You have to use the location and salary filter. You have to scrape data for “Data Scientist” designation for first 10 job results. You have to scrape the job-title, job-location, company name, experience required. The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs The task will be done as shown in the below steps:

1.first get the webpage https://www.naukri.com/
2.Enter “Data Scientist” in “Skill, Designations, and Companies” field.
3.Then click the search button.
4.Then apply the location filter and salary filter by checking the respective boxes
5.Then scrape the data for the first 10 jobs results you get.
6.Finally create a dataframe of the scraped data.

In [146]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [147]:
driver.get("https://www.naukri.com/")

In [148]:
designation=driver.find_element(By.CLASS_NAME,"suggestor-input")
designation.send_keys('Data Scientist')

In [149]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[3]/div/div/div[5]/div/div/div/input")
location.send_keys('Delhi')

In [150]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [151]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [152]:
title_tags=driver.find_elements(By.XPATH,'//a[@class="title fw500 ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)

In [153]:
company_tags=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_tags[0:10]:
    company=i.text
    company_name.append(company)

In [154]:
location_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi location"]')
for i in location_tags[0:10]:
    location=i.text
    job_location.append(location)

In [155]:
experience_tags=driver.find_elements(By.XPATH,'//li[@class="fleft grey-text br2 placeHolderLi experience"]//span')
for i in experience_tags[0:10]:
    exp=i.text
    experience_required.append(exp)

In [156]:
df=pd.DataFrame({'Job Title':job_title,'Job Location':job_location,'Company Name':company_name,'Experience Required':experience_required})
df

,Job Title,Job Location,Company Name,Experience Required
0,Analystics & Modeling Specialist,"Kolkata, Mumbai, Hyderabad/Secunderabad, Pune,...",Accenture,6-8 Yrs
1,Data scientist _Tata Consultancy Services(Tcs),"New Delhi, Kochi/Cochin, Indore, Hyderabad/Sec...",TATA CONSULTANCY SERVICES (TCS),9-14 Yrs
2,Job||Job Opening For AI Technologist - Data Sc...,"New Delhi, Hyderabad/Secunderabad, Pune, Chenn...",Wipro,5-10 Yrs
3,Hiring For DATA Scientist @ NTT DATA Business ...,"Noida, Hyderabad/Secunderabad, Pune, Gurgaon/G...",NTT DATA Business Solutions Private Limited,4-9 Yrs
4,Urgent Job Opening For AI Practitioner - Data ...,"New Delhi, Kochi/Cochin, Bangalore/Bengaluru, ...",Wipro,11-20 Yrs
5,Opening_ Data Scientist_ Pelatro Solutions,"Delhi / NCR, Kolkata, Hyderabad/Secunderabad, ...",Pelatro Solutions,8-12 Yrs
6,Data Scientist,"New Delhi, Pune, Gurgaon/Gurugram, Bangalore/B...",ZS Associates,5-8 Yrs
7,Forecasting Analyst/ Data Scientist (US Client),"Gurgaon/Gurugram, Bangalore/Bengaluru\n(WFH du...",Concentrix,3-8 Yrs
8,Affine- Hiring For Data Science - Work from Home,"Delhi / NCR, Kolkata, Hyderabad/Secunderabad, ...",Affine,4-7 Yrs
9,Looking For Data Scientists,"Delhi / NCR, Noida, Pune, Gurgaon/Gurugram, Ba...",Absolutdata,7-12 Yrs

# Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:

1.Brand
2.Product Description
3.Price

To scrape the data you have to go through following steps:

1.Go to Flipkart webpage by url : https://www.flipkart.com/
2.Enter “sunglasses” in the search field where “search for products, brands and more” is written and click the search icon
3.After that you will reach to the page having a lot of sunglasses. From this page you can scrap the required data as usual.
4.After scraping data from the first page, go to the “Next” Button at the bottom other page , then click on it.
5.Now scrape data from this page as usual
6.Repeat this until you get data for 100 sunglasses.

In [461]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [462]:
driver.get("http://www.flipkart.com/")

In [476]:
product=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/div/input")
product.click()

In [479]:
search=driver.find_element(By.CLASS_NAME,"_213eRC")
search.click()

In [480]:
brand=[]
price=[]

In [481]:
brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_tags[0:100]:
    brnd=i.text
    brand.append(brnd)

In [482]:
price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in price_tags[0:100]:
    Rs=i.text
    price.append(Rs)

In [483]:
sunglasses=pd.DataFrame({'Brand':brand,"Price":price})

In [484]:
sunglasses

                Brand   Price
0         john jacobs  ₹3,325
1       VINCENT CHASE    ₹949
2            Fastrack    ₹799
3           Elligator    ₹298
4          PHENOMENAL    ₹252
5              SUNBEE    ₹283
6                SRPM    ₹211
7       VINCENT CHASE    ₹949
8           New Specs    ₹265
9            Fastrack    ₹639
10             PIRASO    ₹279
11      VINCENT CHASE    ₹949
12           Fastrack  ₹1,169
13             PIRASO    ₹359
14      RM Collection    ₹190
15      VINCENT CHASE  ₹1,533
16            Dadlace    ₹169
17      RM Collection    ₹210
18         LIZA ANGEL    ₹179
19      VINCENT CHASE    ₹849
20          New Specs    ₹207
21     ROZZETTA CRAFT    ₹474
22              NuVew    ₹198
23      VINCENT CHASE    ₹949
24  SHAAH COLLECTIONS    ₹195
25             PIRASO    ₹279
26         IZAAN MART    ₹290
27        john jacobs  ₹2,500
28           Fastrack    ₹719
29         Lee Topper    ₹249
30            Dadlace    ₹149
31      VINCENT CHASE    ₹999
32      RM Collection    ₹310
33      RM Collection    ₹235
34         Lee Topper    ₹299
35      VINCENT CHASE    ₹949
36             PIRASO    ₹279
37             SUNBEE    ₹259
38             Sewell    ₹265
39      VINCENT CHASE    ₹749

# Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone. This task will be done in following steps:

1.First get the webpage https://www.flipkart.com/
2.Enter “iphone 11” in “Search” field .
3.Then click the search button.

you have to scrape the tick marked attributes.These are:

4.Rating
5.Review summary
6.Full review
7.You have to scrape this data for first 100 reviews

In [809]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [810]:
driver.get("http://www.flipkart.com/")

In [817]:
Apple=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/div/input")
Apple.send_keys('iphone11')

In [819]:
search=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [820]:
product=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[3]/div[1]/div[2]/div[2]/div/div/div/a/div[2]/div[1]/div[1]")
product.click()

In [821]:
rating=[]
review_summary=[]
full_review=[]

In [822]:
rating_tags=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
for i in rating_tags[0:10]:
    RA=i.text
    rating.append(RA)

In [823]:
review_tags=driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
for i in review_tags[0:10]:
    Rev=i.text
    review_summary.append(Rev)

In [824]:
reviewfull_tags=driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
for i in reviewfull_tags[0:10]:
    FR=i.text
    full_review.append(FR)

In [825]:
print(len(rating),len(review_summary),len(full_review))

0 0 0

In [826]:
df=pd.DataFrame({'Rating':rating,'Review Summary':review_summary,'Full Review':full_review})
df

Empty DataFrame
Columns: [Rating, Review Summary, Full Review]
Index: []

# Q6: Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in the search field. You have to scrape 4 attributes of each sneaker:

1.Brand
2.Product Description
3.Price

In [535]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [536]:
driver.get("https://www.flipkart.com/")

In [539]:
findp=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/div/input")
findp.click()

In [540]:
product=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div[1]/div[2]/div[2]/form/div/div/input")
product.send_keys('Sneakers')

In [541]:
search=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [542]:
brand=[]
price=[]

In [547]:
brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
for i in brand_tags[0:120]:
    brnd=i.text
    brand.append(brnd)

In [548]:
price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
for i in price_tags[0:120]:
    Prc=i.text
    price.append(Prc)

In [549]:
print(len(brand),len(price))

80 80

In [550]:
Sneakers=pd.DataFrame({'Brand':brand,"Price":price})
Sneakers[0:100]

           Brand   Price
0   Robbie jones    ₹599
1         ELEVAR  ₹5,490
2         DUCATI  ₹1,413
3           PUMA  ₹2,217
4       Magnolia    ₹374
..           ...     ...
75    pollachief    ₹598
76         CLYMB    ₹463
77         AMICO    ₹426
78        DUCATI  ₹1,399
79        ACTION    ₹902

[80 rows x 2 columns]

# # Q7: Go to the link - https://www.myntra.com/shoes Set second Price filter and Color filter to “Black”, And then scrape First 100 shoes data you get. The data should include “Brand” of the shoes , Short Shoe description, price of the shoe as shown in the below image.

In [267]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [268]:
driver.get("https://www.myntra.com/shoes")

In [269]:
price=driver.find_element(By.XPATH,"/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[5]/ul/li[2]/label")
price.click()

In [270]:
colour=driver.find_element(By.XPATH,"/html/body/div[2]/div/div[1]/main/div[3]/div[1]/section/div/div[6]/ul/li[1]/label/span[1]")
colour.click()

In [271]:
brand=[]
price=[]
product_description=[]

In [329]:
brand_tags=driver.find_elements(By.XPATH,'//h3[@class="product-brand"]')
for i in brand_tags[0:100]:
    brnd=i.text
    brand.append(brnd)

In [330]:
price_tags=driver.find_elements(By.XPATH,'//div[@class="product-price"]')
for i in price_tags[0:100]:
    Prc=i.text
    price.append(Prc)

In [331]:
product_tags=driver.find_elements(By.XPATH,'//h4[@class="product-product"]')
for i in product_tags[0:100]:
    des=i.text
    product_description.append(des)

In [332]:
print(len(brand),len(price),len(product_description))

100 100 100

In [333]:
Shoes=pd.DataFrame({'Brand':brand,'Price':price,'Product Description':product_description})
Shoes

           Brand                        Price             Product Description
0           Nike     Rs. 7880Rs. 8295(5% OFF)      Men Winflo 8 Running Shoes
1           Nike     Rs. 7880Rs. 8295(5% OFF)  Men ZOOM WINFLO8 Running Shoes
2           Nike                    Rs. 10795      Men Colourblocked Sneakers
3           Nike     Rs. 7880Rs. 8295(5% OFF)       Men Zoom Winflo 8 Running
4   Hush Puppies    Rs. 8099Rs. 8999(10% OFF)    Men Leather Slip-On Sneakers
..           ...                          ...                             ...
95          Nike  Rs. 11045Rs. 12995(15% OFF)  Women Air Max Pre-Day Sneakers
96  UNDER ARMOUR                     Rs. 6999       Men Lockdown 5 Basketball
97          Nike                     Rs. 8595            Men Leather Sneakers
98      Skechers    Rs. 7199Rs. 8999(20% OFF)    Men Go Walk Arch Fit Walking
99        Clarks                     Rs. 7999  Men Solid Leather Derbys Shoes

[100 rows x 3 columns]

# Q8: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then set CPU Type filter to “Intel Core i7” as shown in the below image: After setting the filters scrape first 10 laptops data. You have to scrape 3 attributesfor each laptop:

1.Title
2.Ratings
3.Price

In [770]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [771]:
driver.get("https://www.amazon.in/")

In [772]:
product=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
product.send_keys('Laptops')

In [773]:
search=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div")
search.click()

In [774]:
CPU=driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[4]/li[12]/span/a")
CPU.click()

In [775]:
title=[]
rating=[]
price=[]

In [780]:
title_tags=driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
for i in title_tags[0:10]:
    tit=i.text
    title.append(tit)

In [781]:
price_tags=driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in price_tags[0:10]:
    Prc=i.text
    price.append(Prc)

In [793]:
rating_tags=driver.find_elements(By.XPATH,'/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[3]/div/span')
for i in rating_tags[0:10]:
    Rtng=i.text
    rating.append(Rtng)

In [794]:
print(len(rating),len(title),len(price))

10 10 10

In [796]:
laptop=pd.DataFrame({'Rating':rating[0:10],'Title':title,'Price':price})
laptop[0:10]

,Rating,Title,Price
0,Customer Reviews,Samsung Galaxy Book2 Intel 12th Gen core i7 39...,"79,490"
1,Customer Reviews,Samsung Galaxy Book2 360 Intel 12th Gen i7 Evo...,"97,990"
2,Customer Reviews,Samsung Galaxy Book2 Intel 12th Gen core i7 39...,"79,490"
3,Customer Reviews,HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...,"87,990"
4,Customer Reviews,"ASUS Vivobook 15, 15.6-inch (39.62 cms) FHD, I...","57,990"
5,Customer Reviews,"ASUS TUF Gaming F17 (2022), 17.3-inch (43.94 c...","1,29,990"
6,Customer Reviews,"ASUS TUF Gaming F15 (2022), 15.6-inch (39.62 c...","1,07,990"
7,Customer Reviews,Lenovo ThinkPad E14 Intel Core i7 11th Gen 14-...,"94,990"
8,Customer Reviews,"ASUS TUF Gaming F15 (2022), 15.6"" (39.62 cms) ...","1,07,990"
9,Customer Reviews,"HP Pavilion Plus, 12th Gen Intel Core i7 16GB ...","89,990"

# Q9: Write a python program to scrape data for first 10 job results for Data Scientist Designation in Noida location. You have to scrape company name, No. of days ago when job was posted, Rating of the company. This task will be done in following steps:

1.First get the webpage https://www.ambitionbox.com/
2.Click on the Job option
3.After reaching to the next webpage, In place of “Search by Designations, Companies, Skills” enter “Data Scientist” and click on search button.
4.You will reach to the following web page click on location and in place of “Search location” enter “Noida” and select location “Noida”.
5.Then scrape the data for the first 10 jobs results you get on the above shown page.
6.Finally create a dataframe of the scraped data

In [365]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [366]:
driver.get("https://www.ambitionbox.com/")

In [367]:
jobs=driver.find_element(By.XPATH,"/html/body/div[1]/nav[2]/div/ul/li[5]/a")
jobs.click()

In [368]:
designation=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[1]/div/div/div/div/span/input")
designation.send_keys('Data Scientist')

In [369]:
search=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[1]/div/div/div/button")
search.click()

In [370]:
select=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[2]/div[1]/div/div/div/div[2]/div[1]/i")
select.click()

In [371]:
location=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[2]/input")
location.send_keys('Noida')

In [372]:
GrN=driver.find_element(By.XPATH,"/html/body/div/div/div/div[2]/div[1]/div[2]/div[1]/div/div/div/div[2]/div[2]/div/div[3]/div[1]/div[1]/div/label")
GrN.click()

In [373]:
company_name=[]
days=[]

In [374]:
days_tags=driver.find_elements(By.XPATH,'//span[@class="body-small-l"]')
for i in days_tags[0:10]:
    dy=i.text
    days.append(dy)

In [384]:
company_tags=driver.find_elements(By.XPATH,'//div[@class="body-small"]')
for i in company_tags[0:10]:
    cmpny=i.text
    company_name.append(cmpny)

In [652]:
Jobs=pd.DataFrame({'No. of days ago':days[0:10],'Company Name':company_name[0:10]})
Jobs

   No. of days ago                                       Company Name
0          10d ago                     Walmart\nData Scientist Salary
1   via naukri.com                    Ab Inbev\nData Scientist Salary
2           3d ago                       Optum\nData Scientist Salary
3   via naukri.com                          ZS\nData Scientist Salary
4           5d ago           Fractal Analytics\nData Scientist Salary
5  via iimjobs.com             Tiger Analytics\nData Scientist Salary
6          20d ago  Legato Health Technologies\nData Scientist Salary
7   via naukri.com                    Tredence\nData Scientist Salary
8          13d ago                UnitedHealth\nData Scientist Salary
9   via naukri.com                  Ford Motor\nData Scientist Salary

# Q10: Write a python program to scrape the salary data for Data Scientist designation. You have to scrape Company name, Number of salaries, Average salary, Minsalary, Max Salary. The above task will be, done as shown in the below steps:

1.First get the webpage https://www.ambitionbox.com/
2.click on the salaries option
3.After reaching to the following webpage, In place of “Search Job Profile” enters “Data Scientist” and then click on “Data   Scientist”. You have to scrape the data ticked in the above image.
4.Scrape the data for the first 10 companies. Scrape the company name, total salary record, average salary, minimum salary, maximum salary, experience required.
5.Store the data in a dataframe

In [663]:
driver=webdriver.Chrome(r"chromedriver.exe")

In [664]:
driver.get("https://www.ambitionbox.com/")

In [665]:
Select=driver.find_element(By.XPATH,"/html/body/div[1]/nav[2]/div/ul/li[3]/a")
Select.click()

In [666]:
bsalary=driver.find_element(By.XPATH,"/html/body/div[1]/nav[2]/div/ul/li[3]/div/ul/li[1]/div")
bsalary.click()

In [678]:
designation=driver.find_element(By.XPATH,"/html/body/div/div/div/main/section[1]/div[2]/div[1]/span/input")
designation.send_keys('Data Scientist')

In [679]:
dclick=driver.find_element(By.XPATH,"/html/body/div/div/div/main/section[1]/div[2]/div[1]/span/div/div/div[1]")
dclick.click()

In [737]:
Experience_Required=[]
company_name=[]
Total_Salary=[]
Average=[]
Minimum=[]
Maximum=[]

In [738]:
experience_tags=driver.find_elements(By.XPATH,'//div[@class="sbold-list-header"]')
for i in experience_tags[0:10]:
    exp=i.text
    Experience_Required.append(exp)

In [739]:
company_tags=driver.find_elements(By.XPATH,'//div[@class="company-info"]//a')
for i in company_tags[0:10]:
    com=i.text
    company_name.append(com)

In [740]:
avg_tags=driver.find_elements(By.XPATH,'//p[@class="averageCtc"]')
for i in avg_tags[0:10]:
    avg=i.text
    Average.append(avg)

In [744]:
TSR_tags=driver.find_elements(By.XPATH,'//span[@class="datapoints"]')
for i in TSR_tags[0:10]:
    TotalR=i.text
    Total_Salary.append(TotalR)

In [756]:
min_tags=driver.find_elements(By.XPATH,"//html/body/div/div/div/div[2]/div/div/div/div[2]/div/ul/li[5]")
for i in min_tags[0:10]:
    minm=i.text
    Minimum.append(minm)

In [742]:
max_tags=driver.find_elements(By.XPATH,'//div[@class="value body-medium"]')
for i in max_tags[0:10]:
    maxm=i.text
    Maximum.append(maxm)

In [757]:
print(len(Experience_Required),len(company_name),len(Total_Salary),len(Minimum),len(Maximum),len(Average))

10 10 10 10 10 10

In [758]:
Records=pd.DataFrame({'Company Name':company_name[0:10],"Experience Required":Experience_Required,"Total Salary Record":Total_Salary,"Maximum Salary":Maximum[0:10], "Minimum Salary":Minimum[0:10],"Average Salary":Average})
Records[0:10]

,Company Name,Experience Required,Total Salary Record,Maximum Salary,Minimum Salary,Average Salary
0,Walmart\nData Scientist Salary,3-4 yrs experience (based on 22 salaries),(based on 22 salaries),₹ 25.0L,Salaries,₹ 31.7L
1,Ab Inbev\nData Scientist Salary,2-4 yrs experience (based on 53 salaries),(based on 53 salaries),₹ 45.0L,Salaries,₹ 19.7L
2,Optum\nData Scientist Salary,2-4 yrs experience (based on 48 salaries),(based on 48 salaries),₹ 15.0L,Salaries,₹ 16.5L
3,ZS\nData Scientist Salary,1-2 yrs experience (based on 33 salaries),(based on 33 salaries),₹ 25.5L,Salaries,₹ 15.7L
4,Fractal Analytics\nData Scientist Salary,2-4 yrs experience (based on 109 salaries),(based on 109 salaries),₹ 11.0L,Salaries,₹ 15.2L
5,Tiger Analytics\nData Scientist Salary,2-4 yrs experience (based on 65 salaries),(based on 65 salaries),₹ 22.6L,Salaries,₹ 14.7L
6,Legato Health Technologies\nData Scientist Salary,4 yrs experience (based on 11 salaries),(based on 11 salaries),₹ 11.0L,Salaries,₹ 14.5L
7,Tredence\nData Scientist Salary,3 yrs experience (based on 12 salaries),(based on 12 salaries),₹ 22.0L,Salaries,₹ 14.1L
8,UnitedHealth\nData Scientist Salary,2-4 yrs experience (based on 91 salaries),(based on 91 salaries),₹ 9.0L,Salaries,₹ 13.6L
9,Ford Motor\nData Scientist Salary,3-4 yrs experience (based on 21 salaries),(based on 21 salaries),₹ 23.0L,Salaries,₹ 13.5L

#

In [759]:
# completed